import crolling_util as crolling_util

sIdx = 1
eIdx = 20
strType = []
strArr = []
RG = ['래쉬가드', '커플래쉬가드', '커플레쉬가드']
VK = ['모노키니', '왕뽕비키니','비키니']
OP = ['비치웨어', '비치원피스']
OP_CP = ['신혼여행커플룩', '비치웨어']
# ########################################################################################################################
# # 대표제품
# ########################################################################################################################
strArr = '서프알로하'
crolling_util.get_rank_product(strArr, RG, sIdx, eIdx)


# strArr = '달리아 신혼여행커플룩'
# crolling_util.get_rank_product(strArr, OP_CP, sIdx, eIdx)