pagePrintCnt = 50

########################################################################################################################
keyNv = []
n1 = {'name':'커플레쉬가드 커플수영복 FB1168_R54', 'item':'R54', 'key':'커플레쉬가드',  'mid1':'80651469478', 'mid2':''}
n2 = {'name':'커플레쉬가드 커플수영복 FB1168_R54', 'item':'R54', 'key':'커플수영복', 'mid1':'80651469478', 'mid2':''}
n3 = {'name':'서프알로하 나시래쉬가드', 'item':'서프알로하', 'key':'래쉬가드', 'mid1':'14489384918', 'mid2':'80495094273'}
n4 = {'name':'왕뽕 하이웨스트 비키니 모노키니', 'item':'왕뽕 하이웨스트', 'key':'왕뽕비키니', 'mid1':'10591394440', 'mid2':'10054140280'}
n5 = {'name':'블루에스닉 커플수영복', 'item':'블루에스닉', 'key':'커플수영복', 'mid1':'14595351003', 'mid2':''}
n6 = {'name':'비치서핑 래쉬가드', 'item':'비치서핑', 'key':'커플래쉬가드', 'mid1':'14638288265', 'mid2':'80452092166'}
n7 = {'name':'크로스 모노키니', 'item':'크로스 모노키니', 'key':'모노키니', 'mid1':'14355364202', 'mid2':'80418993407'}
n8 = {'name':'비치원피스 비치웨어 FB1168_R58', 'item':'FB1168_R58', 'key':'비치원피스', 'mid1':'80657855013', 'mid2':''}

keyNv.append(n1)
keyNv.append(n3)
keyNv.append(n4)
keyNv.append(n5)
keyNv.append(n6)
keyNv.append(n7)
keyNv.append(n2)
keyNv.append(n8)
########################################################################################################################
# 스포츠/레저 > 수영 > 여성수영복 > 비키니
VK = ['왕뽕비키니', '하이웨스트비키니', '비키니', '수영복']
VK1 = ['여성수영복', '여자수영복', '여성비키니', '여자비키니']
VK2 = ['원피스비키니', '비키니쇼핑몰', '비키니커버업', '수영복쇼핑몰', '수영복브랜드', '수영복쇼핑몰']
VK3 = ['섹시비키니', '비키니브랜드', '비키니수영복', '비키니추천']
VK_F1 = ['심플모노키니', '프릴비키니']

# 스포츠/레저 > 수영 > 여성수영복 > 원피스수영복
VK_OP = ['모노키니', '원피스수영복', '실내수영복', '실내수영장수영복', '여자실내수영복', '여성실내수영복']

# 스포츠/레저 > 수영 > 비치웨어 > 커플비치웨어
BW_CP = ['커플래쉬가드', '커플레쉬가드', '커플래시가드', '커플레시가드']
BW_CP1 = ['커플래쉬가드추천', '커플레쉬가드추천', '커플래쉬가드세트', '커플집업래쉬가드', '커플수영복', '커플비치웨어']
BW_CP_F1 = ['신혼여행커플룩']

# 스포츠/레저 > 수영 > 비치웨어 > 상의
BW_TOP = ['래쉬가드', '레쉬가드', '래시가드', '레시가드']
BW_TOP1 = ['여성래쉬가드', '여성레쉬가드', '여성래시가드', '여성레시가드']
BW_TOP2 = ['여자래쉬가드', '여자레쉬가드', '여자래시가드', '여자레시가드']
BW_TOP3 = ['남자래쉬가드', '남자레쉬가드', '남자래시가드', '남자레시가드']
BW_TOP4 = ['남성래쉬가드', '남성레쉬가드', '남성래시가드', '남성레시가드']
BW_TOP5 = ['집업래쉬가드', '집업레쉬가드', '집업래시가드', '집업레시가드']
BW_TOP6 = ['래쉬가드추천', '수영복래쉬가드', '래쉬가드브랜드', '여성집업래쉬가드', '수영복래쉬가드']
BW_TOP_F1 = ['루즈핏래쉬가드', '크롭래쉬가드']

# 스포츠/레저 > 수영 > 비치웨어 > 원피스
OP = ['비치웨어', '비치원피스', '비치웨어쇼핑몰', '비치웨어브랜드']

# 스포츠/레저 > 수영 > 비치웨어 > 상하세트
# BW_TOP_SET = ['래쉬가드세트', '여성래쉬가드세트']

########################################################################################################################
def add_key(kMain, kSub):
    for ks in kSub:
        kMain.append(ks)
    return kMain

VK = add_key(VK, VK1)
VK = add_key(VK, VK2)
VK = add_key(VK, VK3)

BW_CP = add_key(BW_CP, BW_CP1)

BW_TOP = add_key(BW_TOP, BW_TOP1)
BW_TOP = add_key(BW_TOP, BW_TOP2)
BW_TOP = add_key(BW_TOP, BW_TOP3)
BW_TOP = add_key(BW_TOP, BW_TOP4)
BW_TOP = add_key(BW_TOP, BW_TOP5)
BW_TOP = add_key(BW_TOP, BW_TOP6)

key = []
key = add_key(key, VK)
# key = add_key(key, VK_OP)
# key = add_key(key, BW_CP)
# key = add_key(key, BW_TOP)
# key = add_key(key, OP)
#
# # final print
# key = add_key(key, BW_CP_F1)
# key = add_key(key, BW_TOP_F1)
# key = add_key(key, VK_F1)

BW_CP = add_key(BW_CP, BW_CP_F1)
VK = add_key(VK, VK_F1)
BW_TOP = add_key(BW_TOP, BW_TOP_F1)
########################################################################################################################

